#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mDeprecated attribute[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on .terraform/modules/aks/main.tf line 548, in resource "azurerm_kubernetes_cluster" "main":
[33m│[0m [0m 548:       [4mpublic_network_access_enabled[0m,[0m
[33m│[0m [0m
[33m│[0m [0mThe attribute "public_network_access_enabled" is deprecated. Refer to the
[33m│[0m [0mprovider documentation for details.
[33m╵[0m[0m
[32m[1mSuccess![0m The configuration is valid, but there were some
validation warnings as shown above.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.aks.data.azurerm_client_config.this: Reading...[0m[0m
[0m[1mmodule.aks.data.azurerm_resource_group.main: Reading...[0m[0m
[0m[1mmodule.aks.data.azurerm_resource_group.aks_rg[0]: Reading...[0m[0m
[0m[1mmodule.aks.data.azurerm_client_config.this: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04ZjhhNDllYS0wYjA5LTRlNGEtODhhNi0xNmY1NzJmZjQ1NDQ7b2JqZWN0SWQ9ZjhmNDg5ODUtNDIzNC00NzdhLWI5MzQtMjAzZTJlMTVmZDBkO3N1YnNjcmlwdGlvbklkPTAwYzg0OWE0LWQ4YjMtNGQ1Ni05NWZlLTlhMmQwYmI0MGU2OTt0ZW5hbnRJZD1hODk0NTBiOS01OGEzLTRlNmEtOTRiMC05Yzc0NmMwY2I1YTY=][0m
[0m[1mmodule.aks.data.azurerm_resource_group.aks_rg[0]: Read complete after 0s [id=/subscriptions/00c849a4-d8b3-4d56-95fe-9a2d0bb40e69/resourceGroups/rg-team-1-dev][0m
[0m[1mmodule.aks.data.azurerm_resource_group.main: Read complete after 0s [id=/subscriptions/00c849a4-d8b3-4d56-95fe-9a2d0bb40e69/resourceGroups/rg-team-1-dev][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # random_id.prefix[0m will be created
[0m  [32m+[0m[0m resource "random_id" "prefix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 8
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.aks.azapi_update_resource.aks_cluster_post_create[0m will be created
[0m  [32m+[0m[0m resource "azapi_update_resource" "aks_cluster_post_create" {
      [32m+[0m[0m body                    = jsonencode(
            {
              [32m+[0m[0m properties = {
                  [32m+[0m[0m kubernetesVersion = [90mnull[0m[0m
                }
            }
        )
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ignore_casing           = false
      [32m+[0m[0m ignore_missing_property = true
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m output                  = (known after apply)
      [32m+[0m[0m parent_id               = (known after apply)
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m type                    = "Microsoft.ContainerService/managedClusters@2023-01-02-preview"
    }

[1m  # module.aks.azurerm_kubernetes_cluster.main[0m will be created
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster" "main" {
      [32m+[0m[0m api_server_authorized_ip_ranges     = (known after apply)
      [32m+[0m[0m azure_policy_enabled                = false
      [32m+[0m[0m current_kubernetes_version          = (known after apply)
      [32m+[0m[0m dns_prefix                          = (known after apply)
      [32m+[0m[0m fqdn                                = (known after apply)
      [32m+[0m[0m http_application_routing_zone_name  = (known after apply)
      [32m+[0m[0m id                                  = (known after apply)
      [32m+[0m[0m image_cleaner_enabled               = false
      [32m+[0m[0m image_cleaner_interval_hours        = 48
      [32m+[0m[0m kube_admin_config                   = (sensitive value)
      [32m+[0m[0m kube_admin_config_raw               = (sensitive value)
      [32m+[0m[0m kube_config                         = (sensitive value)
      [32m+[0m[0m kube_config_raw                     = (sensitive value)
      [32m+[0m[0m kubernetes_version                  = (known after apply)
      [32m+[0m[0m location                            = "germanywestcentral"
      [32m+[0m[0m name                                = (known after apply)
      [32m+[0m[0m node_resource_group                 = (known after apply)
      [32m+[0m[0m node_resource_group_id              = (known after apply)
      [32m+[0m[0m oidc_issuer_enabled                 = false
      [32m+[0m[0m oidc_issuer_url                     = (known after apply)
      [32m+[0m[0m portal_fqdn                         = (known after apply)
      [32m+[0m[0m private_cluster_enabled             = false
      [32m+[0m[0m private_cluster_public_fqdn_enabled = false
      [32m+[0m[0m private_dns_zone_id                 = (known after apply)
      [32m+[0m[0m private_fqdn                        = (known after apply)
      [32m+[0m[0m public_network_access_enabled       = true
      [32m+[0m[0m resource_group_name                 = "rg-team-1-dev"
      [32m+[0m[0m role_based_access_control_enabled   = false
      [32m+[0m[0m run_command_enabled                 = true
      [32m+[0m[0m sku_tier                            = "Standard"
      [32m+[0m[0m support_plan                        = "KubernetesOfficial"
      [32m+[0m[0m workload_identity_enabled           = false

      [32m+[0m[0m default_node_pool {
          [32m+[0m[0m enable_auto_scaling    = false
          [32m+[0m[0m enable_host_encryption = false
          [32m+[0m[0m enable_node_public_ip  = false
          [32m+[0m[0m kubelet_disk_type      = (known after apply)
          [32m+[0m[0m max_pods               = (known after apply)
          [32m+[0m[0m name                   = "nodepool"
          [32m+[0m[0m node_count             = 2
          [32m+[0m[0m node_labels            = (known after apply)
          [32m+[0m[0m orchestrator_version   = (known after apply)
          [32m+[0m[0m os_disk_size_gb        = 60
          [32m+[0m[0m os_disk_type           = "Managed"
          [32m+[0m[0m os_sku                 = (known after apply)
          [32m+[0m[0m scale_down_mode        = "Delete"
          [32m+[0m[0m type                   = "VirtualMachineScaleSets"
          [32m+[0m[0m ultra_ssd_enabled      = false
          [32m+[0m[0m vm_size                = "Standard_D2s_v3"
          [32m+[0m[0m workload_runtime       = (known after apply)
        }

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }

      [32m+[0m[0m network_profile {
          [32m+[0m[0m dns_service_ip     = (known after apply)
          [32m+[0m[0m docker_bridge_cidr = (known after apply)
          [32m+[0m[0m ip_versions        = (known after apply)
          [32m+[0m[0m load_balancer_sku  = "standard"
          [32m+[0m[0m network_mode       = (known after apply)
          [32m+[0m[0m network_plugin     = "kubenet"
          [32m+[0m[0m network_policy     = (known after apply)
          [32m+[0m[0m outbound_type      = "loadBalancer"
          [32m+[0m[0m pod_cidr           = (known after apply)
          [32m+[0m[0m pod_cidrs          = (known after apply)
          [32m+[0m[0m service_cidr       = (known after apply)
          [32m+[0m[0m service_cidrs      = (known after apply)
        }
    }

[1m  # module.aks.null_resource.kubernetes_cluster_name_keeper[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kubernetes_cluster_name_keeper" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "name" = (known after apply)
        }
    }

[1m  # module.aks.null_resource.kubernetes_version_keeper[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kubernetes_version_keeper" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "version" = [90mnull[0m[0m
        }
    }

[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mDeprecated attribute[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on .terraform/modules/aks/main.tf line 548, in resource "azurerm_kubernetes_cluster" "main":
[33m│[0m [0m 548:       [4mpublic_network_access_enabled[0m,[0m
[33m│[0m [0m
[33m│[0m [0mThe attribute "public_network_access_enabled" is deprecated. Refer to the
[33m│[0m [0mprovider documentation for details.
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @akowasch, Action: `pull_request`*